[
  [
    "https://rateyourmusic.com/release/album/tim-hecker/konoyo/",
    "https://e.snmc.io/i/fullres/w/572a73cf1671e0052a3b68237ee8acd9/7091609",
    "Konoyo",
    "Tim Hecker",
    "2018-10-16",
    "Rules are suffocating, their mere existence a constraint, bound by our own machinations. To create is to liberate. To break rules is to break free. Bach, should, be terrified of Ornette Coleman, and I’d reckon Chaplin would be dizzy after a Harmony Korine film. <br><br> Ambient music exists at the very end of the spectrum, and by definition alone, it is fiercely post-modern and non-musical in every traditional sense. Coined by Brian Eno, it disposes of structure and composition in favour of features it deems more important, such as texture and atmosphere. Bizarrely, such an obtuse form of music would become near ubiquitous as it got relegated to the function of background music. It’s mood music, something to relax to. It is soft and simple. <br><br> You wouldn’t hear Tim Hecker playing at an airport, or at the dentist. Hecker eschews the idioms of ambient music which easily cast it, by the disinterested listener, as muzak. Throughout his career, spanning various albums and styles, Hecker’s brand of ambient music is loud and purposeful, strictly requiring your attention. His music is amorphous, almost as if it were the mutation of sound as music. Perhaps it is even lazy to characterise his brand of music as “ambient”. Hecker’s output, as he states, is an extension of his “obsession with ether and things that aren’t fully formed”, and is “fog-based”, almost embodying a life of its own. His albums are entirely encapsulated, almost as if it is one song, as he conjures abstract soundscapes with what seems like an endless palette of sonic textures. <br><br> With the seminal <i>Ravedeath, 1972</i>, we saw Hecker incorporate more live music into his compositions. Among the distorted drones and aggressive synthesisers, we occasionally caught glimpses of a piano being played, although disfigured and mutated. Each release thereafter would seek to incorporate more instrumentation and live recordings, with <i>Virgins</i> being centred around haunting piano phrases and <i>Love Streams</i> manipulating choral samples. <i>Konoyo</i> takes this one step further, stepping into electroacoustic territory, with its music heavily incorporating and being influenced by <i>Gagaku</i>, the imperial court music of Japan that had its heyday in the Heian Period, in the 9th Century. <br><br> <i>Konoyo</i>’s stylistic origins are traceable to the late Jóhann Jóhannsson, as Hecker revealed in an interview with The Japan Times. During his recording sessions with Jóhannsson, who provided choral arrangements for <i>Love Streams</i>, the composer introduced him to the music of gagaku. With this album Hecker sought to subvert the “super-dense, kind of effect-laden” sound he had put forth in albums prior, and explore notions of negative space, as inspired by the ancient Japanese art form. “There was so much restraint in the music of gagaku, and just this kind of power.” <br><br> <i>Konoyo</i> sees Hecker working with the improvisational compositions of a group of gagaku musicians. Recorded in a temple in Tokyo, his latest album is a dramatic departure from the sound that dominated the majority of his output. On <i>Konoyo</i> we are equally privy to passages of live instrumentation and synthesised distortions. The Canadian musician’s newfound compositional language is profound and abstract, as he pieces together a collage of sharp, glassy synths with ominous ceremonial instrumentation, narrating a disorienting, dissonant rendition of the apocalypse. The soundscapes swirl patiently while gliding synthesisers wail. For Hecker, the world does not end in a blinding blaze of heat. It is however, cold, and we suffer slowly, and acceptingly. <br><br> An impressionistic masterpiece, <i>Konoyo</i> stands tall amongst the rest of the year’s music. Hecker pulls more from the post-rock cookbook than ever before and presents one of his most thought provoking and complete works to date. <i>Konoyo</i> is futuristic while nostalgic, it is hopeful yet despondent, it is foreboding yet majestic. Here, he perfects what he ultimately failed to do in <i>Love Streams</i>. The music on <i>Konoyo</i> wails painfully, but I’m not quite sure what Hecker is trying to tell us. Perhaps that we are slowly crumbling away, day after day. I think he’s right. <br><br>",
    "William Basinski, Fennesz, Ben Frost, Jefre Cantu-Ledesma",
    "This life, Is a rose petal, Keyed out, In mother earth phase, Across to Anoyo",
    "4/5",
    ""
  ],
  [
    "https://rateyourmusic.com/release/album/mika-vainio-ryoji-ikeda-alva-noto/live-2002/",
    "https://e.snmc.io/lk/o/l/aa391f652a657c66f67ffcddc54772b0/7089381.jpg",
    "Live 2002",
    "Mika Vainio + Ryoji Ikeda + Alva Noto",
    "2018-08-07",
    "Aggression has, for the most part, been a matter of force, or damage. They yell, the guitars scream, the drums roar. All a product of man's basest tendencies, a primitive release. Reining it back, <i>Live 2002</i>, is in many ways a controlled exploration of the impulses preceding the violence. Its pulsating sine waves and pricking clicks dig themselves into its listener's skull. Scoring the ascent to man's breaking point, narrating the build up to a night of transgressions and misdeeds.<br><br> The early 2000's was witness to a new era of minimal electronic music characterised by a stripped back electronic sound and glitchy textures. Spearheaded by labels like Raster Noton, the movement failed to truly crystallise into any substantial, with near misses we would see in releases like Ikeda's <i>Dataplex</i> or Ripatti's <i>Entain</i>. Or so we thought. A decade and a half later, we have what could be considered the scene's opus, performed live for a residency in The Baltic Centre For Contemporary Art, all this while tucked away in some dank corner somewhere. <br><br> <i>Live 2002</i> blends minimal techno, glitch and microsound in a truly gorgeous and yet simultaneously unnerving method. Over the course of 11 movements, it presents itself as a true work of art and a labour of love, birthed from spontaneity, yet controlled, measured and sinister.",
    "Fennesz, Vladislav Delay, Ryuichi Sakamoto, Murcof",
    "Movements 2, 4 to 11",
    "4/5",
    ""
  ],
  [
    "https://rateyourmusic.com/release/album/rhye/blood/",
    "https://ia801502.us.archive.org/30/items/mbid-69560996-92c9-491c-8980-57034a34209e/mbid-69560996-92c9-491c-8980-57034a34209e-18997197917.jpg",
    "Blood",
    "Rhye",
    "2018-02-06",
    "The duo consisting of Mike Milosh and Robin Braun, better known as Rhye, would in 2013 release <i>Woman</i>. <i>Woman</i> aggressively dealt with the softer parts of life and love. Bold in its message, but delivered with fragile gentleness, almost soft to the touch, <i>Woman</i> did little to avoid the comparisons to Sade. Milosh's ethereal androgynous vocal melodies filled in by the lush production on pieces like \"Open\" and \"The Fall\" would proceed to create Internet frenzy and garner critical acclaim amongst most publications.<br><br> Early in 2017, Braun would proceed to leave the band as Rhye turned into a solo project with Milosh and a band, centred around its live performances. <i style=\"color: red;\">Blood</i> as such, under the command of Milosh, continues what was started with <i>Woman</i>. The band here, is a direct step up from the studio experiment that <i>Woman</i> was. Each note and measure is calculated, crisp and precise. Played in a mellow and deliberate manner, every pulse of music here, oozes with sexiness and calms the nerves, with a unforetold sophistication. The atmosphere that is intricately sculpted, song by song, is admirable. Rather unfortunate that the album is all style, and no substance.<br><br> The Nicolas Winding Refn of albums, <i>Blood</i> has all the production and instrumental flourishes, but nothing more concrete to back it up, emasculated and stripped of an identity. Agreeable at best, the worst parts of soft pop music come to light over the course of 42 minutes. Music you could nod your head to, but nothing more. The lack of any emotive and powerful songs like \"Open\" from Rhye's debut also makes for a consistently plain, and unoffensive album. The only exception to this rule is track nine, \"Phoenix\". Embracing a groove, Rhye work out of their comfort zone, creatively reworking funk motifs. Milosh chants, \"oh my god\", as the bass-line takes a life of its own.<br><br> Though the album never reaches the peaks the band's debut did, it offers a couple of decent songs sprinkled about to make the listening experience marginally pleasant. Almost ironically, <i>Blood</i> seems to be trying its best to emulate <i>Woman</i>, whereas it undeniably has the potential to forgo the clichés of its soft rock roots and be something more wild and free. Something with a mind of its own. With some sort of personality. Come on Mike.<br><br>",
    "Sade, Jessie Ware, Sampha",
    "Phoenix, Count to Five, Taste",
    "2.5/5",
    ""
  ],
  [
    "https://rateyourmusic.com/release/ep/panda-bear/a-day-with-the-homies/",
    "https://ia801502.us.archive.org/3/items/mbid-77f8c442-fe25-4a88-9222-f1ce73206ef9/mbid-77f8c442-fe25-4a88-9222-f1ce73206ef9-18822434789.jpg",
    "A Day With the Homies",
    "Panda Bear",
    "2018-01-17",
    "Panda Bear, born Noah Lennox, has become a prevalent figure withing the indie music community. A purveyor of genres, Lennox and his artistic counterpart Avey Tare (Michael Portner) have created some of the wildest and most original compositions from the mysterious space they seem to occupy in the music world. Animal Collective's work, before and including \"Merriweather Post Pavillion\" have been heralded as masterful works of experimental pop and folk music. Somewhere somehow, Lennox's solo work started to overshadow Animal Collective's output. Well, not <i>somehow</i>. \"Person Pitch\" was released in 2007. The single greatest Animal Collective record was a hazy, anti-social and weird Panda Bear solo LP. \"Person Pitch\", undeniably Lennox's magnum opus, would become the defining psych-pop record of the 21st Century, like a \"Loveless\" of shoegaze or an \"Illmatic\".<br><br> Lennox would continue to put out two good, verging on great, albums after \"Person Pitch\". Out of absolutely no where, Lennox drops \"A Day With The Homies\", a 29 minute EP just a couple of days ago as I am writing this. Upping his social media activity out of the blue, Lennox is essentially drafting up buzz, for what might be his 5th solo LP.<br><br> \"Homies\" is possibly a bunch of outtakes from the forthcoming LP, or not. Regardless, the tracks do well enough on their own. Generally disconnected thematically, sonically everything blends into one, as is trademark of an Animal Collective member. Every track here sways back and forth, warped and wrapped in nature recordings and bizzare sonic textures. Lennox's best Brian Wilson impression comes through again, like ever, transforming the obfuscated hazy production into something ethereal. Choir boy vocals ran through an SP-404 delay makes for a dreamy soundscape, in which one could get lost easily.<br><br> In my personal copy of \"Person Pitch\", the inner booklet lists a bunch of artists directly influencing Lennox's work. It is perhaps strange that Lennox, who dabbles in forms of psychedelic music, would be so heavily influenced by techno musicians such as Wolfgang Voigt and Deep House architect Luomo amongst many other. Then again perhaps it isn't. The majority of Lennox's work has had a prevalent \"driving force\" behind them , highly reminiscent of common techno beat patterns.<br><br> \"Homies\" is however, very outright with this, with a bouncy kick drum and a buzzy bass from the opener 'Flight', continuing the Mr. Sonic Boom's sounds off of Lennox's previous solo effort \"Panda Bear Meets the Grim Reaper\". With all the highs of this album, sonics can only do so much. Structurally it is inherently deficient, in the sense that is only an EP. That said, Animal collective have had standup EP's such as \"Fall Be Kind\". Lennox's current schtick, the \"busy for the sake of being busy\" sound, is occasianally annoying here. Still this manages to be a more memorable experience than one of the last two Animal Collective albums.<br><br> On \"Homies\", Lennox essentially gives us a taste of the upcoming album, yet, it stands rather well on its own. Whatever Noah has been brewing over the last couple of years, I want it.",
    "Animal Collective, The Flaming Lips, Deerhunter",
    "Flight, Sunset, Nod to the Folks, Part of the Math",
    "3.5/5",
    ""
  ],
  [
    "https://rateyourmusic.com/release/album/n_e_r_d/no-one-ever-really-dies/",
    "https://ia800101.us.archive.org/3/items/mbid-a6422e70-43e7-48c1-b854-ef15db9f983d/mbid-a6422e70-43e7-48c1-b854-ef15db9f983d-18730232377.jpg",
    "NO ONE EVER REALLY DIES",
    "N*E*R*D",
    "2018-01-08",
    "After the seminal \"In Search Of...\", N*E*R*D's offerings throughout the noughties were but a string of disappointing releases. As the collective fell off everyone's radar, its most prominent member, Pharrell Williams, began his meteoric rise to stardom. Chad Hugo and Williams would continue to produce together as \"The Neptunes\".  Williams' work became ubiquitous with hit single after hit single, year after year . While Williams' wasn't working on frivolous commercial albums like \"Girl\" and on the soundtrack of films like \"Despicable Me\", \"Despicable Me 2\" and the nerve-wracking conclusion \"Despicable Me 3\", his more discrete production work absolutely took off. As Williams' and The Neptunes' resume of production credits grew, they presented some of the most off-kilter, original and creative production the hip-hop scene had ever encountered. They had transfor what would otherwise be bland pop songs, dynamic and filled with life. The duo had carved themselves a place in hip-hop's history after producing Clipse's monstrous \"Hell Hath No Fury\", an absolutely electric piece of work.<br><br> Cut to 2017 and Williams is now a household name. The first single \"Lemon\" is released out of the left-field with only some cryptic marketing prior. And not too long after, this album is announced. <br><br> NO ONE EVER REALLY DIES is iconic and striking from the get go. The album art is bizarre and strange, vulgar and yet memorable, with a woman donning a foil grill, shot in a style vaguely reminiscent of Terry Richardson. The production on this album is alive, booming and undeniably fierce. Exploring new ground effortlessly song by song. The album blends the hardest, most experimental shades of hip-hop with the ethos of pop music almost seamlessly. Energetic performances from a wide selection of guest vocalists ranging from Gucci Mane to Ed Sheeran (who is surprisingly decent on this) to Kendrick with the highly varied production and beat switches makes for an engaging and addictive listen. The album starts off strong, with hard hitters like \"Lemon\" and \"Voila\" leading the way, the latter featuring an insanely catchy hook with Gucci Mane. For the fifth track, we are gifted with \"Don't Do It!\", featuring Kendrick, arguably the best song on this album. Pulsating with its short guitar stabs, the track explores some dense lyrical ground regarding police brutality and racial unrest, as does a lot of this album.<br><br> Tracks 6 to 8 are a short lull in this album. While exploring new sounds and ideas, they fail to pay off in any way in this stretch. \"ESP\" is generally dull, structured quite poorly and the production isn't going to save the entire 5 minutes. Same goes for \"Lightning Fire Magic Prayer\", and \"Rollinem 7's\". The only thing here that is worth salvaging is Andre 3K's fiery but short verse.<br><br> Things pick up again afterwards, with \"Kites\" featuring M.I.A and Kendrick, with some of the most hypnotic production on this album. M.I.A's woozy delivery and Kendrick's razor sharp delivery together are a little jarring but are certainly a refreshing change from the stagnant tracks prior. However, \"Secret Life of Tigers\" is Williams at his most woke, where the lyrics turned from an accessory of the production to obnoxious and silly, making it hard to take the song seriously. This is all rather unfortunate as the song could have evidently been so much more. The album finishes with \"Lifting You\" featuring Ed Sheeran, where he isn't absolutely dreadful. Things end on a relaxed and rather limp note, with easy going production that sticks out in the album, and not in a good way. The more aggressive and edgy production is really what made many of the earlier songs on here enjoyable.<br><br> Through several listens, it has become evident that we do indeed have a good album over here. But, its inconsistencies are really the only thing stopping this album from being truly great. While most ideas here are original and new, some are plagues by structural and lyrical issues. Lyrically, Williams leaves a lot to be desired given the difficult topics he tries to cover. Despite all this, the album is mostly enjoyable but given some more, I reckon this album is one that will make its mark in the future as \"quintessential N*E*R*D\"",
    "Tyler, The Creator, Clipse",
    "Lemon, Voila, Don't Do It!, Deep Down Body Thurst",
    "3/5",
    ""
  ],
  [
    "https://rateyourmusic.com/release/album/taylor-swift/reputation/",
    "https://ia600805.us.archive.org/7/items/mbid-91e96c04-9ced-4566-b273-b60b9c40ad3e/mbid-91e96c04-9ced-4566-b273-b60b9c40ad3e-17610493930_thumb500.jpg",
    "Reputation",
    "Taylor Swift",
    "2017-11-14",
    "Not too long ago, the world was introduced to the girl next door and singer-songwriter, Taylor Swift, along with her guitar and her country tinged pop songs. Upon entering the scene, Swift instantly made massive waves in the music industry and pop culture, for better or worse, with singles like \"You belong with me\" and \"Teardrops on My Guitar\". The young and oh so naive Swift would in the early 2010's, evolve into your standard cookie cutter international pop star with the clean polished image and corporate music pieces that labels like PC Music could unironically ship. Singles like \"We Are Never Ever Getting Back Together\" , \"Shake it Off\" and \"Knew You Were Trouble\" were marketing masterpieces, with just the right lyrics and just the right amount of saccharine plastic production. Then there were the rough years for the international pop star, with the negative media attention and the notorious back and forth with Kanye West. The oh so pristine image of Swift had been gradually tainted in the public eye over the years.<br><br> The biggest catalyst for Swift Inc.'s latest re-branding effort \"Reputation\" would have to be the back and forth between West over the infamous \"Famous\" verse on West's latest project \"The Life of Pablo\". For the unaware, on the song, West in the first 30 seconds proclaims that he \"and Taylor might still have sex\" as he \"made that bitch famous\". This led to a lot of publicised tension between the two parties, with the apex of this being Kim Kardashian releasing a video depicting Swift's consent to West's verse on \"Famous\".<br><br> That brings us to today. Swift is now an edgy, mature and self-aware pop star, or at least that is what she so desperately tries to be. As a declaration of her edginess, Swift releases an hour long album which immediately falls flat on its face. Even Swift's previous material was passable, not that I would actively listen to it, but I could without a knee-jerk reaction as intense and visceral as this one. Sonically, this has to be one of the worst produced pop albums in a long time. The sonics that producers Max Martin and Shellback bring on \"Reputation\" are absolutely grating, with some of the worst mixing I have ever had the misfortune of hearing, especially prominent on the first track \"...Ready For It?\".<br><br> \"...Ready For It\" presents some sort of some cheap, disgraceful imitation of West's \"Yeezus\", with the large, buzzy baseline and blaring horns. The industrial-esque production of the start of the song is immediately juxtaposed with Swift's regular cookie cutter pop star singing and harmonising over synth pads which eventually all end up in the mix together. The mish-mash of the bass, horns, distorted snares and Swift's vocals at the end of the track produces a sonic trainwreck, which ends up being unlistenable thanks to the horrible mixing.<br><br> Other deeper cuts like \"Look What You Made Me Do\" and \"Gorgeous\" have some laughable production choices. As the album progresses, the Yeezus fetish dies off and Swift quickly settles into her old self, with some basic synthpop songs and what ever is currently in (tropical house and a trap song featuring Future). Not to say that they are in any way remarkable. In fact they are the very opposite. Dull and dross. Swift does an impeccable FKA Twigs impersonation in \"Dress\", almost unnervingly similar to the structure and melodies of Twigs' song \"Pendulum\". Quite surprisingly, the final track has a funny jittery piano piece, expressing some real, genuine sentimentality for the first time in the entire album. Ironically, this was the last track and this atmosphere dies off after the first minute, when the awkward guitar decides to stroll into the mix.<br><br> Lyrically, the album is filled with cringeworthy snippets of Swift trying to be shocking. The main culprit here is Swift's hyper literalism, which left me wincing. I guess it is true that only a work of great art from an artist who had mastered his craft could evoke such a physical reaction. Swift forgoes any semblance of subtlety, expressing what she wants to in an almost vulgar, brutish way. There are a couple of songs in particular, which display Swift's literary prowess. On \"I Did Something Bad\", she likens herself to a witch being burned at the stake literally, \"They're burning all the witches even if you aren't one, So light me up (x8)\". On lead single \"Look What You Made Me Do\" she explains the reinvention of her image and identity by suggesting that the \"old Taylor can't come to the phone right now. Why? Oh, 'cause she's dead!\". Swift also describes her past year as \"so Gatsby\". When Swift isn't being a lyrical brute, she unexpectedly sings about her relationship and love life, not saying anything worth noting.<br><br> The biggest achievement of it all was my unending patience to sit through all this, and to come into it with an open mind. \"Reputation\" does nothing well, not the arrangements, not the lyrics. In fact, it is not unreasonable to say it does nothing good. Flat generic vocal performances mixed in with drab over-produced and poorly mixed music all makes for a product to attract attention, not an album. The right product for Swift's market segment, the preteens when Swift first broke through, who are now angry hormonal teenage girls who can relate this vapid mess.<br><br>",
    "Musical equivalent of drinking bleach, Merzbow, The Gerogerigegege",
    "None",
    "1/5",
    ""
  ],
  [
    "https://rateyourmusic.com/release/album/jefre_cantu_ledesma/love_is_a_stream/",
    "https://ia801200.us.archive.org/11/items/mbid-2338ad44-083a-4912-be51-08a8b35feedb/mbid-2338ad44-083a-4912-be51-08a8b35feedb-14633084720.jpg",
    "Love Is a Stream",
    "Jefre Cantu-Ledesma",
    "2017-11-13",
    "Like a warm hug, from someone you've never seen. Cantu-Ledesma channels everything raw and pure into 44 minutes of bliss. As the title suggests, the album is a continuous stream of tracks and passages all evocative of some unknown and warmer time. Everything from the cover art to the production feels warm. A warm embrace. Love Is a Stream is the most texturally beautiful thing my ears have had the pleasure of hearing in a long while, very much resembling Fennesz's efforts in endless summer. It is unfortunate that in the context of the album, some songs are rather lacklustre and somewhat repetitive. Unlike some of the veterans of the ambient and drone scene, Cantu-Ledesma is unable to make an album, or an experience. Luckily, a handful of dense and mesmerizing pieces help string something together. Something inexplicably warm. A warm embrace.",
    "Tim Hecker, Yellow Swans, Grouper, My Bloody Valentine, Fennesz",
    "Body Within Body, Where You End & I Begin, Womb Night, River Like Spine, Wild Moon and Sea",
    "3.5/5",
    ""
  ],
  [
    "https://rateyourmusic.com/release/album/ash-koosha/aktual",
    "https://ia800102.us.archive.org/16/items/mbid-5d1298d7-222d-42b3-87a1-dff935eeebe9/mbid-5d1298d7-222d-42b3-87a1-dff935eeebe9-18192569759_thumb500.jpg",
    "AKTUAL",
    "Ash Koosha",
    "2017-11-06",
    "Born in Iran and raised in London, beat wizard Ashkan Kooshanejad, better known by his alias Ash Koosha broke into the scene with debut album Guud in 2015. Taking the freneticism of Flying Lotus' signature LA beat sound further, Koosha could do no wrong. Guud was a monolith, dark and brooding, complex and suffocating. Koosha continued this assault on the senses, in a lesser manner on his sophomore LP, I AKA I. On AKTUAL, Koosha is able to channel back some of the earlier energy, while exploring new ground through vocal performances. Koosha manages to hit his highest high with track \"TrappistOne\", a master stroke in ambient music. However, the inconsistent textures, sounds and ideas do not complement the disjoint nature of this LP, which worked on his previous efforts. The juxtaposition of more complex IDM pieces versus the sombre vocal performances makes AKTUAL feel more like a set of demos, with its highs and lows.",
    "Arca, Holly Herndon, Actress, Crazy Glitchy Beats",
    "Magnet, Aktual II, TrappistOne, Aroha",
    "3/5",
    ""
  ]
]