[
  [
    "https://rateyourmusic.com/release/album/n_e_r_d/no-one-ever-really-dies/",
    "https://e.snmc.io/lk/o/l/b27e599ede6bbfac1157ec2834a8a30d/6755882.jpg",
    "NO ONE EVER REALLY DIES",
    "N*E*R*D",
    "2018-01-08",
    "After the seminal \"*In Search Of...*\", N\\*E\\*R\\*D's offerings throughout the noughties was but a string of disappointing releases. As the collective fell off everyone's radar, its most prominent member, Pharrell Williams, began his meteoric rise to stardom. Chad Hugo and Williams would continue to produce together as \"The Neptunes\".  Williams' work became ubiquitous with hit single after hit single, year after year . While Williams' wasn't working on frivolous commercial albums like \"Girl\" and on the soundtrack of films like \"Despicable Me\", \"Despicable Me 2\" and the nerve-wracking conclusion \"Despicable Me 3\", his more discrete production work absolutely took off. As Williams' and The Neptunes' resume of production credits grew, they presented some of the most off-kilter, original and creative production the hip-hop scene had ever encountered. They had transfor what would otherwise be bland pop songs, dynamic and filled with life. The duo had carved themselves a place in hip-hop's history after producing Clipse's monstrous \"Hell Hath No Fury\", an absolutely electric piece of work.<br><br> Cut to 2017 and Williams is now a household name. The first single \"Lemon\" is released out of the left-field with only some cryptic marketing prior. And not too long after, this album is announced. <br><br> NO ONE EVER REALLY DIES is iconic and striking from the get go. The album art is bizarre and strange, vulgar and yet memorable, with a woman donning a foil grill, shot in a style vaguely reminiscent of Terry Richardson. The production on this album is alive, booming and undeniably fierce. Exploring new ground effortlessly song by song. The album blends the hardest, most experimental shades of hip-hop with the ethos of pop music almost seamlessly. Energetic performances from a wide selection of guest vocalists ranging from Gucci Mane to Ed Sheeran (who is surprisingly decent on this) to Kendrick with the highly varied production and beat switches makes for an engaging and addictive listen. The album starts off strong, with hard hitters like \"Lemon\" and \"Voila\" leading the way, the latter featuring an insanely catchy hook with Gucci Mane. For the fifth track, we are gifted with \"Don't Do It!\", featuring Kendrick, arguably the best song on this album. Pulsating with its short guitar stabs, the track explores some dense lyrical ground regarding police brutality and racial unrest, as does a lot of this album.<br><br>",
    "Tracks 6 to 8 are a short lull in this album. While exploring new sounds and ideas, they fail to pay off in any way in this stretch. \"ESP\" is generally dull, structured quite poorly and the production isn't going to save the entire 5 minutes. Same goes for \"Lightning Fire Magic Prayer\", and \"Rollinem 7's\". The only thing here that is worth salvaging is Andre 3K's fiery but short verse.<br><br> Things pick up again afterwards, with \"Kites\" featuring M.I.A and Kendrick, with some of the most hypnotic production on this album. M.I.A's woozy delivery and Kendrick's razor sharp delivery together are a little jarring but are certainly a refreshing change from the stagnant tracks prior. However, \"Secret Life of Tigers\" is Williams at his most woke, where the lyrics turned from an accessory of the production to obnoxious and silly, making it hard to take the song seriously. This is all rather unfortunate as the song could have evidently been so much more. The album finishes with \"Lifting You\" featuring Ed Sheeran, where he isn't absolutely dreadful. Things end on a relaxed and rather limp note, with easy going production that sticks out in the album, and not in a good way. The more aggressive and edgy production is really what made many of the earlier songs on here enjoyable.<br><br> Through several listens, it has become evident that we do indeed have a good album over here. But, its inconsistencies are really the only thing stopping this album from being truly great. While most ideas here are original and new, some are plagues by structural and lyrical issues. Lyrically, Williams leaves a lot to be desired given the difficult topics he tries to cover. Despite all this, the album is mostly enjoyable but given some more, I reckon this album is one that will make its mark in the future as \"quintessential NERD\"",
    "Tyler, The Creator, Clipse",
    "Lemon, Voila, Don't Do It!, Deep Down Body Thurst",
    "3/5",
    ""
  ],
  [
    "https://rateyourmusic.com/release/album/taylor-swift/reputation/",
    "https://e.snmc.io/lk/o/l/e968fe32ed5b3c8bc65962f3c46c3095/6643299.jpg",
    "Reputation",
    "Taylor Swift",
    "2017-11-14",
    "Not too long ago, the world was introduced to the girl next door and singer-songwriter, Taylor Swift, along with her guitar and her country tinged pop songs. Upon entering the scene, Swift instantly made massive waves in the music industry and pop culture, for better or worse, with singles like \"You belong with me\" and \"Teardrops on My Guitar\". The young and oh so naive Swift would in the early 2010's, evolve into your standard cookie cutter international pop star with the clean polished image and corporate music pieces that labels like PC Music could unironically ship. Singles like \"We Are Never Ever Getting Back Together\" , \"Shake it Off\" and \"Knew You Were Trouble\" were marketing masterpieces, with just the right lyrics and just the right amount of saccharine plastic production. Then there were the rough years for the international pop star, with the negative media attention and the notorious back and forth with Kanye West. The oh so pristine image of Swift had been gradually tainted in the public eye over the years.<br><br> The biggest catalyst for Swift Inc.'s latest re-branding effort \"Reputation\" would have to be the back and forth between West over the infamous \"Famous\" verse on West's latest project \"The Life of Pablo\". For the unaware, on the song, West in the first 30 seconds proclaims that he \"and Taylor might still have sex\" as he \"made that bitch famous\". This led to a lot of publicised tension between the two parties, with the apex of this being Kim Kardashian releasing a video depicting Swift's consent to West's verse on \"Famous\".<br><br> That brings us to today. Swift is now an edgy, mature and self-aware pop star, or at least that is what she so desperately tries to be. As a declaration of her edginess, Swift releases an hour long album which immediately falls flat on its face. Even Swift's previous material was passable, not that I would actively listen to it, but I could without a knee-jerk reaction as intense and visceral as this one. Sonically, this has to be one of the worst produced pop albums in a long time. The sonics that producers Max Martin and Shellback bring on \"Reputation\" are absolutely grating, with some of the worst mixing I have ever had the misfortune of hearing, especially prominent on the first track \"...Ready For It?\".<br><br> \"...Ready For It\" presents some sort of some cheap, disgraceful imitation of West's \"Yeezus\", with the large, buzzy baseline and blaring horns. The industrial-esque production of the start of the song is immediately juxtaposed with Swift's regular cookie cutter pop star singing and harmonising over synth pads which eventually all end up in the mix together. The mish-mash of the bass, horns, distorted snares and Swift's vocals at the end of the track produces a sonic trainwreck, which ends up being unlistenable thanks to the horrible mixing.<br><br> Other deeper cuts like \"Look What You Made Me Do\" and \"Gorgeous\" have some laughable production choices. As the album progresses, the Yeezus fetish dies off and Swift quickly settles into her old self, with some basic synthpop songs and what ever is currently in (tropical house and a trap song featuring Future). Not to say that they are in any way remarkable. In fact they are the very opposite. Dull and dross. Swift does an impeccable FKA Twigs impersonation in \"Dress\", almost unnervingly similar to the structure and melodies of Twigs' song \"Pendulum\". Quite surprisingly, the final track has a funny jittery piano piece, expressing some real, genuine sentimentality for the first time in the entire album. Ironically, this was the last track and this atmosphere dies off after the first minute, when the awkward guitar decides to stroll into the mix.<br><br> Lyrically, the album is filled with cringeworthy snippets of Swift trying to be shocking. The main culprit here is Swift's hyper literalism, which left me wincing. I guess it is true that only a work of great art from an artist who had mastered his craft could evoke such a physical reaction. Swift forgoes any semblance of subtlety, expressing what she wants to in an almost vulgar, brutish way. There are a couple of songs in particular, which display Swift's literary prowess. On \"I Did Something Bad\", she likens herself to a witch being burned at the stake literally, \"They're burning all the witches even if you aren't one, So light me up (x8)\". On lead single \"Look What You Made Me Do\" she explains the reinvention of her image and identity by suggesting that the \"old Taylor can't come to the phone right now. Why? Oh, 'cause she's dead!\". Swift also describes her past year as \"so Gatsby\". When Swift isn't being a lyrical brute, she unexpectedly sings about her relationship and love life, not saying anything worth noting.<br><br> The biggest achievement of it all was my unending patience to sit through all this, and to come into it with an open mind. \"Reputation\" does nothing well, not the arrangements, not the lyrics. In fact, it is not unreasonable to say it does nothing good. Flat generic vocal performances mixed in with drab over-produced and poorly mixed music all makes for a product to attract attention, not an album. The right product for Swift's market segment, the preteens when Swift first broke through, who are now angry hormonal teenage girls who can relate this vapid mess.<br><br>",
    "Musical equivalent of drinking bleach, Merzbow, The Gerogerigegege",
    "None",
    "1/5",
    ""
  ],
  [
    "https://rateyourmusic.com/release/album/jefre_cantu_ledesma/love_is_a_stream/",
    "https://e.snmc.io/lk/o/l/83bd173422efbab9c0b66e2b3d1c2bb7/3325650.jpg",
    "Love Is a Stream",
    "Jefre Cantu-Ledesma",
    "2017-11-13",
    "Like a warm hug, from someone you've never seen. Cantu-Ledesma channels everything raw and pure into 44 minutes of bliss. As the title suggests, the album is a continuous stream of tracks and passages all evocative of some unknown and warmer time. Everything from the cover art to the production feels warm. A warm embrace. Love Is a Stream is the most texturally beautiful thing my ears have had the pleasure of hearing in a long while, very much resembling Fennesz's efforts in endless summer. It is unfortunate that in the context of the album, some songs are rather lacklustre and somewhat repetitive. Unlike some of the veterans of the ambient and drone scene, Cantu-Ledesma is unable to make an album, or an experience. Luckily, a handful of dense and mesmerizing pieces help string something together. Something inexplicably warm. A warm embrace.",
    "Tim Hecker, Yellow Swans, Grouper, My Bloody Valentine, Fennesz",
    "Body Within Body, Where You End & I Begin, Womb Night, River Like Spine, Wild Moon and Sea",
    "3.5/5",
    ""
  ],
  [
    "https://rateyourmusic.com/release/album/ash-koosha/aktual",
    "https://e.snmc.io/lk/f/l/2f23b5385238e83dafecd701aceae7f6/6729745.jpg",
    "AKTUAL",
    "Ash Koosha",
    "2017-11-06",
    "Born in Iran and raised in London, beat wizard Ashkan Kooshanejad, better known by his alias Ash Koosha broke into the scene with debut album Guud in 2015. Taking the freneticism of Flying Lotus' signature LA beat sound further, Koosha could do no wrong. Guud was a monolith, dark and brooding, complex and suffocating. Koosha continued this assault on the senses, in a lesser manner on his sophomore LP, I AKA I. On AKTUAL, Koosha is able to channel back some of the earlier energy, while exploring new ground through vocal performances. Koosha manages to hit his highest high with track \"TrappistOne\", a master stroke in ambient music. However, the inconsistent textures, sounds and ideas do not complement the disjoint nature of this LP, which worked on his previous efforts. The juxtaposition of more complex IDM pieces versus the sombre vocal performances makes AKTUAL feel more like a set of demos, with its highs and lows.",
    "Arca, Holly Herndon, Actress, Crazy Glitchy Beats",
    "Magnet, Aktual II, TrappistOne, Aroha",
    "3/5",
    ""
  ]
]